Revit 2024 API
ControlledApplication.DocumentChanged Event
 Subscribe to the DocumentChanged event to be notified when Revit document has changed.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public event EventHandler<DocumentChangedEventArgs> DocumentChanged
Visual Basic
Public Event DocumentChanged As EventHandler(Of DocumentChangedEventArgs)
Visual C++
public:
 event EventHandler<DocumentChangedEventArgs^>^ DocumentChanged {
	void add (EventHandler<DocumentChangedEventArgs^>^ value);
	void remove (EventHandler<DocumentChangedEventArgs^>^ value);
}
Remarks
 This event is raised whenever a Revit transaction is either committed, undone or redone. This is a readonly event, designed to allow you to keep external data in synch with the state of the Revit database. To update the Revit database in response to changes in elements, use the IUpdater framework.
See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace